[
  {
    "path": "posts/datamakeover2/",
    "title": "DataViz Makeover2",
    "description": "A introduction of making interactive dashboard in Tableau!",
    "author": [
      {
        "name": "Linya Huang",
        "url": "https://www.linkedin.com/in/linya-huang/"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Asessment of Clarity and Aesthetics in Original Design\r\n3. Alternative Design Sketches and Published Dashboard\r\n4. Tableau Tutorial Step-by-Step4.1 Data Preparation in Tableau Prep\r\n4.2 Data Makeover in Tableau Desktop\r\n\r\n5. Major Observations\r\nReference:\r\n\r\n1. Introduction\r\nIn this data visualization makeover, I will apply interactive techniques in tableau to make an animated dashboard.\r\nThe original design is from Department of Statistics, Singapore\r\nFigure 1.1 Original Visualization2. Asessment of Clarity and Aesthetics in Original Design\r\nClarity\r\nMisleading circle presentation By applying total trading value as size, some countries have circle occupying both net importers and net exporter areas, hence the roles of counties around diagonal area is not very clear.\r\nNo key insights annotation The only key insights reader get at the first glance is the top net importer/exporter countries with marked star and animated arrows, but more insights should have been derived from the visualization.\r\nNotes Discrepancy Meanwhile, the only note in the bottom describes the information of China and US since 2009 and 2006, which mismatches the main visualization showing trading value of 2020.\r\nUnclear x-y axis label The label of both axis should be moved to right and top respectively, although it has been differentiated by 2 colors, putting them together at the zero point is not a wise choice. And currency unit should also been added in both axis.\r\nAesthetics\r\nPoor use of color There are 10 different solid circles with white dot center representing countries, as well as 2 different colors representing background and axis ticks in the chart, making the whole design too colorful for professional business/economy data presentation. Also, the blue and green globe circle is redundant for axis labels.\r\nCrowded labels and circles Due to the crowded design, some circles and labels are overlapping with each other and some currency label is missing. Besides, some label are even exceeded the main chart. This is a very poor use of scatter plot and labels.\r\nPoor Animation The design of flashing up/down arrow in the stars is meaningless. In addition, when hovering mouse to countries, the vibration does not provide additional insights at all.\r\nSuggestions to based on original design\r\nImprovement of color and scatter circle Try to apply fewer kinds of color to represent importer and exporter countries, and remove background color and circle for axis label. Revise opacity of circle and add boarder to avoid overlap area and distinguish countries.\r\nFine-tune text elements Revise labels and title and add key insights.\r\nRemove meaningless animations Remove all unnecessary animations in the chart.\r\n3. Alternative Design Sketches and Published Dashboard\r\nTo overcome the issues discussed above, here is my proposal of design sketches.\r\n In the alternative design, I plan to use three graph charts.\r\nScatter Plot\r\nInspired by Viualization from Esteban Ortiz-Ospina and Nicolas Lippolis 2017, to show two dimension comparison of time series data, I would like to track the trajectory path of Import and Export value on a scatter plot with year as path and dot as values. I will make the dot small to avoid overlapping as much as possible. Then, by dragging the year slicer on top of the chart, the user can see a clear yearly evaluation path of specific country. In terms of color usage, I will only use 2 colors to differentiate importer and exporter roles for dot label, so that the chart won’t be very crowded and colorful for business presentation.\r\nSlope/Line Chart\r\nI will add another slope/line chart right next to the scatter plot to provide a quick and clear overview that how import/export/total trading/net export value has been changed throughout the selected period. I will use diverging colors to highlight countries with high values in dark blue and ‘hide’ those with low values in light gray colors. The clear absolute dollar values and % change trend in slope/line graph will be a good supplement to the scatter plot.\r\nCountry List\r\nA country list by select measure ranking will be add to the right of the dashboard, so that user can select or hover to any country and highlight in both charts. This can help solve the poor animation problem discussed above and make the chart more interactive.\r\nInteractive Approach\r\n•1. A year slicer will be added into the table for user to select different year period. •2. Region, line/slope graph and select measure will be added as filter so that user can focus on desired focal. •3. Ideally, when hovering mouse to any of trajectory (in scatter plot), line (in slope/line graph) or country (in country list), other visualization will show the highlighted objectives and ‘hide’ others.\r\nClarity\r\n•Clear Year Pattern-By using year path and dot presentation, the value will be clearly represented. •Added title and key insights-Title will be tuned and insights will be added so that reader can get the important message at the first glance. •Revised Axis Labels-Currency unit will be added to axis labels.\r\nAesthetics\r\n•Suitable Color Presentation for Business Purpose- background color will be removed from original design and fewer color will be applied in the new design. •Clear Labels and Numbers and no Overlapping- Values and changes during the period will be presented more clearly and misleading overlapping area will be avoided. •Interactive Slicer,Filter and Highlighter- Users will have multiple selection for different focal and the values will be highlighted across charts with simple click or hover.\r\nThe final look of the data visualization makeover is available in Tableau Public.\r\nFigure 3.2 Final Look of new design4. Tableau Tutorial Step-by-Step\r\n4.1 Data Preparation in Tableau Prep\r\nThe data is downloaded from sub-section of Merchandise Trade by Region/Market. Let’s download the file to local drive, unzip and open it.\r\nNoted the raw data has 3 tabs, content, T1(import) and T2(export). In both T1 and T2, top 3 rows consists introduction of data and followed by countries/ continents variables , currency unit and values from 1976 January till 2021 March.\r\n4.1.2 Load data to tableau Prep\r\nAfter understanding the raw data structure. Next, let’s launch Tableau Prep Builder and load data.\r\n•1.click Connect to Data button\r\n•2.select Microsoft Excel on the left bar\r\n•3.locate to target file folder\r\n•4.confirm and click Open\r\n4.1.3 Check Data Interpreter\r\nAfter loading the data, the excel sheets will appear on the left side bar. Then check the box of Use Data Interpreter so that tableau can help to clean the excel workbook , for example, to remove the top 3 rows introduction and locate to the main table in the sheet.\r\nFigure 4.1.3 Check Data Interpreter4.1.4 Initialize Workspace\r\nDrag sheet T1 into work space.\r\n\r\nClick the round “+” button next to T1\r\n\r\nClick add Clean Step.\r\n\r\n4.1.5. Remove Non-target Date Columns\r\nSince we are only interested in date period from 2011 and 2020, let’s remove those non-target period following the steps below.\r\nclick show list view\r\n\r\nselect non-target date columns by pressing ‘shift’ key on the keyboard\r\n\r\nright click and select remove\r\n\r\nFigure 4.1.5. Remove Non-target Date Columns4.1.6. Split Currency and Country Name\r\nNoticed that Variables column does not follow the same pattern, as some of the coutries has two parentheses in the colunmn, such as Slovak Republic (Slovakia)(Thousand Dollars). Therefore, to split them, a few steps are performed as below.\r\nTRIM( SPLIT( [Variables], “(”, 1 ) )\r\n\r\nTRIM( SPLIT( [Variables], “(”, 2 ) )\r\n\r\nTRIM( RIGHT([Variables], if(FINDNTH([Variables],“(”, 2) > 0) then LEN([Variables]) - FINDNTH([Variables],“(”, 2) - LEN(“(”) + 1 else 0 end) )\r\n\r\nTRIM( SPLIT( [Variables - Split 2], “Dollars”, 1 ) )\r\n\r\nTRIM( SPLIT( [Variables - Split 3], \" \", 1 ) )\r\n\r\nIF [Variables - Split 2 - Split 1] != “Thousand” AND [Variables - Split 2 - Split 1] != “Million” THEN [Variables - Split 3 - Split 1] ELSE [Variables - Split 2 - Split 1]END\r\n\r\nIF [Variables - Split 3 - Split 1] =“Thousand” THEN [Variables - Split 1]+“(”+[Variables - Split 2 - Split 1] ELSE [Variables - Split 1] END\r\n\r\nRemove the intermediate columns and leave the relative country and currency only.\r\n\r\nFigure 4.1.6. Split Country and Currency Columns4.1.7. Filter Country\r\nFilter out continents and header ‘Total Merchandies Imports’ by clicking Country variable >> Filter by selected value\r\nFigure 4.1.7. Split Country and Currency Columns4.1.8. Add Pivot Step and Get a Pivot Table\r\n•1. Click on the ‘+’ button next to ‘Clean 1’ step at the work space area and selecting Pivot option.\r\n•2. Select Columns to Rows option and drag all dates to Pivot Fields.\r\n4.1.9. Calculate Values\r\nCreate Calculated Field by inputting the formulas below.\r\n4.1.10. Rename and Remove Variables\r\n•1. Then Remove the calculate columns as Values(Import) , [Pivot 1 Values] by selecting the field and clicking remove option •2. Rename [Pivot Names] to [Date] •3. Remove [Currency Unit] field\r\nFigure 4.1.10. Rename and Remove Filed4.1.11. Repeat and join T1 and T2\r\n•1. Repeat the same steps for table T2(Export data) as we just did for T1 •2. Drag T2 to T1 to join two tables\r\nFigure 4.1.11.Join T1 and T24.1.12. Table Join Rules\r\n•1. Applied ‘Date’ and ‘Country’ Join Clauses •2. Choose the full join type\r\nFigure 4.1.12 Tabel Join Rules4.1.13. Add Calculated Fields\r\nThen, let’s create 2 calculation filed as below,\r\n“Net Export=[Values (Export)]-[Values (Import)]”\r\n“Total Trading Values=[Values (Export)]+[Values (Import)]”\r\nFigure 4.1.13 Add Calculated Fields4.1.14. Download Standard country statistical use table\r\nIn order to enable country and region selection in the final design, I downloaded the standard country statistical use table online.\r\nAccording to Department of Statistics, Singapore-International Classifications, the Standard country or area codes for statistical use (M49) is applied for country and region mapping.\r\nDownload the excel file from the website.\r\nSelect ‘Region Name’ and ‘Country or Area’ two columns as highlighted in Figure 4.1.14.\r\nFigure 4.1.14 UNSD Table4.1.15. Import UNSD Table and Map Country and Region\r\nImport table into the work space and join with the cleaned data generated from above steps.\r\nInput ‘Country’=‘Country’ as applied join clauses.\r\n4.1.16. Clean Jion2 Data\r\n•1. Remove duplicated Country-1 Variable •2. Create calculated field “Year=YEAR([Date])” •3. Remove Date Column •4. Filter Countries Yamen Democratic and Germany, Democratic Republic Of with no value during the period\r\n4.1.17. Aggregate Data by Year\r\nSince we are only interested in the long term period time, let’s add another aggregate step following Clean 3 Step.\r\nDrag Country/Year/Region to the left aggregated panel and numerical values to the right panel.\r\nFigure 4.1.17. Aggregate Data by Year4.1.18. Output Cleaned Data\r\nMove on to the last clean data step, add output step to get the tableau file.\r\n• 1. Click on Browse\r\n• 2. Locate to the file location, change the File name\r\n• 3. Click Run Flow button to get the tableau output file\r\nFigure 4.1.18. Output Cleaned Data4.2 Data Makeover in Tableau Desktop\r\n4.2.1. Import Cleaned Data into Tableau Desktop\r\nDrag the cleaned data into Tableau Desktop\r\nFigure 4.2.1. Import Cleaned Data into Tableau Desktop4.2.2. Create Parameters\r\n•1. Right click blank area and select create parameters •2. Create two parameters as shown in the figure 4.2.2\r\n4.2.3. Create Calculated Field for Parameters\r\n•1. Right click blank area and select create calculated field •2. Create two calculated field ‘Select Measure’ and ‘Line/Slope Toggle’ as shown in figure 4.2.3\r\nFigure 4.2.3. Create Calculated Field for Parameters4.2.4. Slope Chart - Columns, Rows and Filters\r\n•1. Drag Years to Columns, Select Measure to Rows •2. Double click blank ares next to select measure and input formula ‘MIN(1)’ •3. Drag ‘Country’,‘Region’ and ‘Line/Slope Toggle’ to Filters\r\nFigure 4.2.4. Slope Chart - Columns, Rows and Filters4.2.5. Slope Chart - Dual Axis Bar Chart\r\n•1. Make ‘Min(1)’ as dual axis •2. Change the Marks type to Bar •3. Double click ‘Min(1)’ axis and change the range type to ‘Fixed’ 0-1\r\nFigure 4.2.5. Slope Chart - Dual Axis Bar Chart4.2.6. Slope Chart- Format Size and Color\r\n•1. Change the size of the bar to minimum •2. Update color of ‘MIN(1)’ and ‘Select Measure’ Variables\r\nFigure 4.2.6. Slope Chart - Slope Chart- Format Size and Color4.2.7. Slope Chart- Chart Detail and Color Format\r\n•1. Change mark ‘Select Measure’ as Line •2. Drag ‘Country’ as detail and ‘Select Measure’ as color options under mark •3. Edit color into custom diverging with 5 steps\r\nFigure 4.2.7. Slope Chart - Chart Detail and Color Format4.2.8. Slope Chart- Add labels\r\n•1. Add ‘Country’,‘Select Measure’ to label •2. Format labels with no decimal and prefix ‘$’\r\nFigure 4.2.8. Slope Chart - Add labels4.2.9. Slope Chart- Add % of Change Labels for Year End1\r\nCreate ‘% change’ and ‘% change label’ calculation fields.\r\nFigure 4.2.9. Slope Chart - Add % of Change Labels for Year End4.2.10. Slope Chart- Add Left Labels and Parameters\r\n•1. Add ‘% change label’ as label •2. Click Label and check Label start/end of line •3. Right click parameters and check Show Parameter\r\n4.2.11. Scatter Plot - Columns and Rows \r\n•1. Drag ‘Export’ to columns and 2 ‘Import’ to rows •2. Make ’Import’dual axis and uncheck show headers\r\nFigure 4.2.11. Scatter Plot - Columns and Rows4.2.12. Scatter Plot - Create Calculation Field \r\nCreate a calculation field to differenciate trade dificit and trade surplus.\r\nFigure 4.2.12. Scatter Plot - Create Calculation Field4.2.13. Scatter Plot - Create Path\r\n•1. Change the types of ‘SUM(Import)(2)’marks as Line •2. Drag ’Country’ as detail and label option under Marks •3. Drag ‘Year’ as path option under Marks and change the color to gray\r\nFigure 4.2.13. Scatter Plot - Create Path4.2.14. Scatter Plot - Create Dot\r\n•1. Change the types of ‘SUM(Import)(2)’marks as Circle •2. Drag ’Country’ as detail,‘Importer/Exporter’ as color, ‘Year’ as Label, ‘Select Measure’ as size and tooltip •3. Change the color of ‘Trade Deficit’ and ‘Trade Surplus’\r\n4.2.15. Country List\r\nLet’s create another worksheet as a country list selection panel.\r\n•1. Create another calculation field called ‘Rank’ as shown in Figure 4.2.15. as below •2. Drag ‘Country’ to rows and ‘Year’,‘Region’,‘Country’ to filters as well •3. Drag ‘Rank’ as label under marks\r\n4.2.16. Country List Let’s create another worksheet as a country list selection panel.\r\n•1. Create another calculation field called ‘Rank’ as shown in Figure 4.2.15. as below •2. Drag ‘Country’ to rows and ‘Year’,‘Region’,‘Country’ to filters as well •3. Drag ‘Rank’ as label under marks\r\nFigure 4.2.15. Country List4.2.16. Dashboard Layout\r\n•1. Create a dashboard sheet •2. Place charts, filter,legend to the dashboard •3. Add Text and Blank objects with layout shown as below\r\n4.2.17 Create Highlight Action\r\nTo make the dashboard more interactive and highlight the country in both charts when selecting or hovering mouse, please follow the steps below. •1. Click dashboard >> actions on the menu bar •2. Create 1 filter and 2 highlight actions as shown in Figure 4.2.17\r\n4.2.18 Check the Country List as Filter\r\nClick ‘More Options’ of the country list chart and check ‘Use as Filter’ Option.\r\nBy doing so, when user select countries on the right country list filter, the country will be highlighted in both charts.\r\nFigure 4.2.18. Check the Country List as Filter4.2.19 Format Text Title\r\nDouble Click the text to edit. Below is the sample of how parameters are added, such that when switching between select measure, the title of the text will change accordingly.\r\nFigure 4.2.19. Format Text Title4.2.20 Add Animation\r\nTo make the dashboard more intersting, lets add animation function in the chart to show the changing path.\r\n•1. Click Format >>Animations\r\n•2. Click On and change the duration to 2.0 seconds\r\nFigure 4.2.20. Add AnimationBravo! We have completed the dashboard!\r\nTableau Public.\r\nFigure 5.15. Major Observations\r\n•1.With the selection of ‘Total Trading’, ‘Line Graph’, ‘All Region’ and top 10 countries highlighted, we can find the 10 years trading patterns. Of 10 top trading countries, 9 of them are from Asian region except United States. Mainland China exceeded Malaysia in year 2013 and becomes Singapore largest trading partner, increasing to S$136B with 33% by the end of year 2020. Meanwhile, in year 2016, half of the top 10 trading partners -Mainland China, Malaysia, US, Indonesia and Republic of Korea- experienced a sudden drop in total trading values. When switching the graph option to ‘Slope’, it is observed that largest % of total trading comes from Taiwan (+64%) and United (+35%), while India (-44%) and Indonesia(-40%) in the opposite.  •2. Selecte’Net Export’, ‘Slope Graph’ for right chart. In the largest Asian markets, Hong Kong is the biggest net exporter of Singapore all time with over $S50B dollars and increased 11% during the time. While other former leading exporters such as Malaysia and Indonesia, the net export value has dropped significantly, especially Malaysia has become Singapore’s net importer by end of year 2020 at -$12B dollars. For Singapore merchandise importers, Taiwan is taking the leading position in year 2020 as its import values increased about 2 times as shown in the left graph (y-axis).\r\nFigure 5.2.1 Net Export Insights_Asia•3. For other regions, such as American Regions, United States net export value increased from bottom position to the top among other countries in the region (at S$6B +127%) in year 2020. As shown in the trajectory graph, the export value with United States has increased about 2 times during the period.\r\nFigure 5.2.2 Net Export Insights_AmericaFor Europe Regions, the import and export values fluctuates significantly with net export value range from -$1B to $2B, except for Netherlands and Belgium, of which the net export value has a stable increase and reached to $11B and $5B respectively in 2020.\r\n\r\nWhile for Oceania Regions, they all have merchandise trade surplus with Singapore. However,Australia, the largest trading partner of the region, has $7B (-27%) drop in net export values mainly contributing by the shrinking of export volumes -$8B.\r\nFigure 5.2.4 Net Export Insights_OceaniaThank you for reading up to this point!\r\nReference:\r\nDepartment of Statistics, Singapore. (2020). Retrieved from Merchandise Trade Performance with Major Trading Partners, 2020: https://www.singstat.gov.sg/modules/infographics/singapore-international-trade\r\nEsteban Ortiz-Ospina, Nicolas Lippolis. (2017, October 30). Our World in Data. Retrieved from Are emerging economies deindustrializing too quickly?: https://ourworldindata.org/growth-and-structural-transformation-are-emerging-economies-industrializing-too-quickly\r\nInternational Classifications. (2021). Retrieved from Department of Statistics,Singapore: https://www.singstat.gov.sg/standards/international-classifications\r\nSleeper, R. (2021). Playfair Data. Retrieved from 3 Ways to Make Splendid Slope Graphs in Tableau: https://playfairdata.com/3-ways-to-make-splendid-slope-graphs-in-tableau/\r\nStandard country or area codes for statistical use (M49) Overview. (2021). Retrieved from UN - Statistics Division: https://unstats.un.org/unsd/methodology/m49/\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-18T22:39:42+08:00",
    "input_file": "datamakeover2.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "DataViz Makeover1",
    "description": "My first data visualization makeover and step-by-step Tableau tutorial for beginners!",
    "author": [
      {
        "name": "Linya Huang",
        "url": "https://www.linkedin.com/in/linya-huang/"
      }
    ],
    "date": "2021-05-27",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Asessment of Clarity and Aesthetics in Original Design\r\n3. Alternative Design Sketches and Published Dashboard\r\n4. Tableau Tutorial Step-by-Step4.1 Data Preparation in Tableau Prep\r\n4.2 Data Makeover in Tableau Desktop\r\n\r\n5. Major Observations\r\n\r\n1. Introduction\r\nThis is my first data visualization makeover blog.\r\nThe original design (Figure 1.1) used 6 area charts to show monthly fluctuations of Singapore’s import and export values with six trading countries. The data is retrieved from singapore Statistics, Merchandise Trade by Region/Market.\r\nFigure 1.1 Original VisualizationIn this blog, I will explore different perspectives and approaches to improve the original design.\r\n2. Asessment of Clarity and Aesthetics in Original Design\r\nIn the first stage, let’s examine the original visualization in two aspects Clarity and Aesthetics.\r\nClarity\r\n•1. The title and chart are not consistent. From the charts we cannot tell how “Top Six Trading” is identified and how countries are ranked or compared. Besides, the title period is for period 2019 – 2020, but the charts demonstrate data from 2019 to 2021 on monthly basis.\r\n•2. The y axis ticks differ from countries as well as import/ export values, hence it is impossible to compare across countries or net import/export values. And within single chart, overlapping areas represent different values which is very misleading.\r\n•3. There are certain contents missing in the dashboard, for example, currency unit, an important element in measuring values; source of the data, leaving no evidence to support the charts; annotation of key insights, leaving readers not easily understand messages conveyed from the dashboards at first glance.\r\n•4. The fluctuations of the data in the charts are confusing as x axis represents year, but readers cannot tell the time interval among fluctuations and link to axis values easily.\r\nAesthetics\r\n•1. The size of charts is not consistent. Especially, 2019 data is missing for Japan.\r\n•2. Six area charts used, making each chart too small, and leaving redundant information (such as unnecessary repeated x/y axis labels) and lots of blank areas in overall design.\r\n•3. The font of the title is not in bold form but x axis, y axis and legend are in bold form, and the size of the title is smaller than individual charts, which lays emphasizes incorrectly.\r\n•4. The data label on the right “Measure Names” can be further tuned.\r\n3. Alternative Design Sketches and Published Dashboard\r\nTo overcome the issues discussed above, here my proposal of design sketches.\r\nFigure 3.1 Alternative Graphical RepresentationIn the alternative design, I plan to use two types of charts.\r\nIn the top scatter plot, I would like to compare 3 dimensions, namely, export, net export-import and total trading values. In economics, the concept of balance of trade, calculated by net export (import – export) is widely used. A trade surplus occurs when the result of the net export is positive, while trade deficit occurs when the calculation is negative. Therefore, the net export value is selected as y axis. Then, in order to give a reader a rough overview of the total trading values and comparison between countries and year, the size of bubbles will represent total trading values (export + import) and for each country, there will be 2 bubbles to show 2019 and 2020 values respectively.\r\nIn the bottom chart, I plan to compare the quarterly fluctuations of trading values for 6 countries during the period. First of all, to replace monthly fluctuations in original design, I will use quarterly time interval rather than monthly to reveal accurately longer-term economic trends. Secondly, to avoid misleading overlapping area in the original design, I plan to split export and import values to different charts and reverse the axis of import values, which is also consistent as net export- import calculation as scatter plot. In particular, all y axis and sizes of charts will stay consistent for all charts. In addition, I will format on the labels, legends, fronts, sizes in the dashboard and add the missing elements, such as currency unit, annotations, key insights etc. into the revised version.\r\nClarity\r\n•1. The comparisons are clearer in terms of total trading values/export/net export in the top chart and quarterly trend of export/import values in the bottom chart across countries.\r\n•2. Readers can easily get the message conveyed of the visualizations through titles and annotations.\r\n•3. The misleading dual axis is avoided.\r\nAesthetics\r\n•1. Two types of the charts are applied to add more insights and colors.\r\n•2. The format of title, fronts, labels and legends will be revised and improved.\r\n•3. The overall design of the charts is more organized and redundant information or blank areas will be removed.\r\nAdditional Insights\r\nThe net export value, a commonly used economics indicator, is added to the chart to convey clear and straightforward message of trading relationship with Singapore.\r\nThe final look of the data visualization makeover is available in Tableau Public.\r\nFigure 3.2 Data Visualization Makeover Final Design4. Tableau Tutorial Step-by-Step\r\n4.1 Data Preparation in Tableau Prep\r\n4.1.1 Download data from website\r\nThe data is downloaded from sub-section of Merchandise Trade by Region/Market. The raw data has 3 tabs, content, T1(import) and T2(export). In both T1 and T2, top 3 rows consists introduction of data and followed by countries/ continents variables , currency unit and values from 1976 January till 2021 March.\r\nFigure 4.1.1. Data Downloaded from Website4.1.2 Load data to tableau Prep\r\nAfter understanding the raw data structure. Next, let’s launch Tableau Prep Builder and load data.\r\n•1.click Connect to Data button\r\n•2.select Microsoft Excel on the left bar\r\n•3.locate to target file folder\r\n•4.confirm and click Open\r\nFigure 4.1.2. Data Load to Tableau Prep4.1.3 Check Data Interpreter\r\nAfter loading the data, the excel sheets will appear on the left side bar. Then check the box of Use Data Interpreter so that tableau can help to clean the excel workbook , for example, to remove the top 3 rows introduction and locate to the main table in the sheet.\r\nFigure 4.1.3 Check Data Interpreter4.1.4 Initialize Workspace\r\nDrag sheet T1 into work space.\r\n\r\nClick the round “+” button next to T1\r\n\r\nClick add Clean Step.\r\n\r\nFigure 4.1.4 Initialize Workspace4.1.5. Remove Non-target Date Columns\r\nSince we are only interested in date period from 2019 and 2020, let’s remove those non-target period following the steps below.\r\nclick show list view\r\n\r\nselect non-target date columns by pressing ‘shift’ key on the keyboard\r\n\r\nright click and select remove\r\n\r\nFigure 4.1.5. Remove Non-target Date Columns4.1.6. Filter Target Countries\r\nThen, let’s also filter the target countries in column Variables.\r\nClick more options “…” next to the Variables column\r\n\r\nClick ‘Filter’\r\n\r\nClick ‘Selected Values’\r\n\r\nFilter target courtiers by using the ‘searching bar’\r\n\r\nClick ‘Done’ once finished\r\n\r\n4.1.7 Split Country Names and Currency Unit\r\nNext, to trim the country name and currency unit, click the [Variable] columns and then click ‘Automatic Split button’.\r\nFigure 4.1.7 Split Country Names and Currency Unit4.1.8 Remove and Rename Columns\r\nRemove the original [Variable] column and double click [Variable -Split1] to rename it as [Country].\r\nFigure 4.1.8 Remove and Rename Columns4.1.9. Add Pivot Step\r\nIdeally, the data structure should be switched to un-pivoted format and reorganized in only 3 columns (date, country and values) for visualization purpose. To achieve this, follow the steps by clicking on the ‘+’ button next to ‘Clean 1’ step at the workspace area and selecting Pivot option.\r\nFigure 4.1.9. Add Pivot Step4.1.10 Reorganize Data Structure\r\nUnder the Columns to Rows selection, drag all dates into ‘Pivoted Fields’. Then all columns are un-pivoted and integrated into 3 = [Pivot Names],[Pivot1 Values] and [Country].\r\nFigure 4.1.10 Reorganize Data Structure4.1.11 Create Calculated Filed of Pivoted Values\r\nAs the original values are in thousand units, let’s resume the values by creating a calculated filed.\r\n• 1. Click Pivot1 Values\r\n• 2. Select Create Calculated Filed button\r\n• 3. Input the Filed Name as Import and formula [Pivot1 Values]*1000\r\n• 4. Click ‘Apply’ and ‘Save’ button\r\nFigure 4.1.11 Create Calculated Filed of Pivoted Values4.1.12 Remove and Rename Pivot Variables\r\nThen, for final formatting of T1 sheet, let’s rename the filed [Date] by double clicking the column name and remove [Pivot Values].\r\nSimilarly, repeat the same data load, Clean 1 and Pivot 1 steps for T2.\r\nFigure 4.1.12 Remove and Rename Pivot Variables4.1.13 T2 Pivot Calculation\r\nRepeat same steps in 4.1.11 and 4.1.12. And do note to change the pivoted calculated filed name as ‘Export’.\r\nFigure 4.1.13 T2 Pivot Calculation4.1.14 Join Two Tables-1\r\n• 1. In the workspace, click on the Pivot 2 and drag it next to Pivot 1. Then, 2 options – Union and Join- will occur as boxes next to Pivot 1.\r\n• 2. Drag ‘Pivot 2’ to ‘Join’ option and let go of the mouse click.\r\nFigure 4.1.14 Join Two Tables-14.1.15 Join Two Tables-2\r\nBy default, tableau will suggest only one joint clauses for two tables and we need to add another constrain. Make sure 2 clauses-Country and Date- are added here.\r\nTo confirm the output, as shown below, there will be 144 items matched with each other. (Joint result should be 6 countries * 24 months= 144 items in total)\r\nFigure 4.1.15 Join Two Tables-24.1.16 Remove Repeated Join Columns\r\nLast but not the least, remove the repeated join columns [Date] and [Country].\r\nFigure 4.1.16 Remove Repeated Join Columns4.1.17 Data Preparation Final Look\r\nBingo! Here we have completed the data cleaning!\r\nFigure 4.1.17 Data Preparation Final Look4.1.18 Add Output Step\r\nMove on, we have to add output step to get the tableau file.\r\nFigure 4.1.18 Add Output Step4.1.19 Data Preparation Output - Run Flow\r\n• 1. Click on Browse\r\n• 2. Locate to the file location, change the File name as ‘cleaned_data_import_export’\r\n• 3. Click Run Flow button\r\nFigure 4.1.19 Data Preparation Output - Run FlowFinally, we manage to get the cleaned data in tableau extract format.\r\n4.2 Data Makeover in Tableau Desktop\r\nNext, let’s make the final visualization in desktop step by step.\r\n4.2.1 Data Launch in Tableau Desktop\r\nTo start,\r\n•1.Launch Tableau Desktop, click on ‘file’ in the menu bar.\r\n•2.Select ‘Open’ in the drop-down list.\r\n•3.Locate to ‘cleaned_data_import_export’ file location , confirm and click ’Open ’button.\r\nFigure 4.2.1 Data Launch in Tableau Desktop4.2.2. Change Date Format\r\nAfter importing the data, noticed that date is still in string format. To modify, hover mouse to ‘Abc’ icon, click and chose ‘Date’ in the drop-down list. Then, the date will be changed as ‘dd/mm/yyyy’ format.\r\nFigure 4.2.2 Change Date Format4.2.3 Tableau Desktop Layout\r\nHere we are at the Tableau Desktop working station.\r\nFigure 4.2.3 Tableau Desktop LayoutScatter Plot\r\n4.2.4 Create Net Export Calculated Field\r\n• 1.Double click ‘sheet1’ and rename it as ‘Scatter Plot’\r\n• 2. Hover mouse to blank area of the Data Pane, right click and select ‘Create Calculated Field…’\r\n• 3. In the formula window, add new variable name -Net Export-Import($SGD Billion)-and formula [Export]-[Import], confirm and click Apply and Save button.\r\nFigure 4.2.4 Create Net Export Calculated Filed4.2.5 Drag Columns and Rows to Scatter Plot\r\nDrag Columns and Rows to top shelves.\r\nFigure 4.2.5 Drag Columns and Rows - Scatter Plot4.2.6 Create Bubble Label Calculation Field\r\nSimilarly, create another calculation filed as ‘Bubble Label’ to achieve customized bubble colors.\r\nFigure 4.2.6 Create Bubble Label Calculation Filed - Scatter Plot4.2.7 Create Total Trading Values Calculation Filed\r\nThen, create one more calculation filed ‘Total Trading Values($SGD Billion)’ by adding ‘[Export]+[Import]’ values\r\nFigure 4.2.7 Create Total Trading Values Calculation Filed - Scatter Plot4.2.8 Add Color and Size to Bubbles\r\n•1. Drag ‘Bubble Label’ and ‘Total Trading Values($SGD Billion)’ to ‘Marks’ area as Color and Size respectively.\r\n•2. Click on ‘Size’ icon and drag the slicer to change the bubble size.\r\nFigure 4.2.8 Add Color and Size to Bubbles- Scatter Plot4.2.9 Sort Bubble Legends\r\n•1. Click Edit icon for the ‘Bubble Label’ Legend on the right\r\n•2. Select Sort option in the drop-down list\r\n•3. In Sort window, select ‘Manual’ in the drop-down list\r\n•4. Sort the value based on the year and total trading value in descending orders\r\nFigure 4.2.9 Sort Bubble Legends- Scatter Plot4.2.10 Change Bubble Colors\r\n•1.Similarly, select ‘Edit Colors’ for ‘Bubble Label’ Legend on the right\r\n•2. Choose a color Palette – ‘Tableau 20’\r\n•3. Click on each legend and update the colors\r\n•4. Click ‘Apply’ and ‘OK’ once done\r\nFigure 4.2.10 Change Bubble Colors- Scatter Plot4.2.11 Format Bubble Boarders\r\nTo add boarders to the bubble and change to solid color fill,\r\n•1. Click drop-down list and select ‘Circle’\r\n•2. Click Color and change the opacity and boarder options\r\nFigure 4.2.11 Format Bubble Boarders- Scatter Plot4.2.12 Add More Labels\r\nDrag more labels (‘Country’ and ‘Date’) to the charts.\r\nNow we have a first draft of the scatter plot!\r\nLet’s leave as it is now and move on. We will come back later and adjust format.\r\nBar Charts\r\n4.2.13 Add Bar Chart for China(Export)\r\nThen, we continue to build bar chart sheets for the bottom part.\r\n•1. Create a new work sheet named ’China(Export)’\r\n•2. Drag [Export] to Rows and [Date] to Columns. Click drop-down list from [Date] and select ‘Quarter’ Option\r\n•3. In the marks filed, select ‘Bar’ option\r\n•4. Drag [Country] to Filters filed\r\n•5. In the filter window, check the box of ‘Mainland China’ and click ‘OK’ button\r\nFigure 4.2.13 Add Bar Chart for China(Export) - Bar Chart4.2.14 Format Bar Chart for China(Export)\r\nSubsequently, let’s adjust the formatting of the sample bar chart.\r\n•1. Hover mouse to the title area, right click and select ‘Hide title’\r\n•2. Hover mouse to x axis area, right click and un-check ‘Show Header’\r\n•3. Hover mouse to any chart area, right click and select ‘Format’ option\r\n•4. On the left pane, locate to rows and update ‘Grid Lines’ option as None in drop-down list\r\nFigure 4.2.15 Format Bar Chart for China(Export) - Bar Chart\r\n4.2.15 Duplicate Export Chart for Other Countries\r\n•1. Right click on ‘China(Export)’ sheet in the bottom, select ‘duplicate’\r\n•2. Rename the duplicate sheet as ‘(Export)’, and change the filter accordingly\r\n•3. Update the color of the bar same as scatter plot color palette\r\n•4. Hover to the y axis area and un-check ‘Show Header’\r\n•5. Repeat the same steps for other countries and eventually get 6 ‘(Export)’ bar charts\r\nFigure 4.2.15 Duplicate Export Chart for Other Countries - Bar Chart4.2.16 Add Bar Chart for China(Import)\r\nRepeat similar steps in creating export chart and create first Import chart for China, but take note that in step 4 and 5 to fix y axis and reverse it.\r\nFigure 4.2.16 Add Bar Chart for China(Import) - Bar Chart\r\n4.2.17 Duplicate Import Chart for Other Countries\r\nSimilarly, duplicate the steps for other countries. And you will get 6 export and 6 import sheets in total.\r\n4.2.18 Initialize Layout of Dashboard\r\nSubsequently, create a new dashboard and drag sheets and text objects to the workspace. Then, format the size and layout accordingly.\r\nFigure 4.2.18 Design Layout of Dashboard4.2.19 Add Quarterly Import Shift\r\nAfter plotting all bar charts in dashboard, it is observed that a shift occurs in 19Q4 and 20Q1, hence, we can highlight this trend by add customized colors into the bar charts with below steps.\r\n•1. Create another calculation filed ‘shift’ with formula - IF [Date]>DATE(“30-09-2019”) AND [Date]<DATE(“01-04-2020”) THEN [Country]+“1” ELSE [Country]+“0” END\r\n•2. Add the measure to color marks\r\n•3. Edit colors of the legend\r\nSimilarly, drag such measure to other import charts and update colors.\r\nFigure 4.2.19 Add Quarterly Import Shift -Bar Chart4.2.20 Add Annotation\r\n•1. Right click blank area in of the scatter plot, select ‘Annotate’ >> ‘Point’\r\n•2. In the ‘Edit Annotation’ window, input the value\r\n•3. Format the annotation by removing default ‘Shading’ and ‘Line’\r\nFigure 4.2.20 Add Annotations -Dashboard4.2.21 Add More Annotations\r\nNoted the label we added before is not good enough. After observing more insights from the data. Again, repeat the steps and manually add more annotations.\r\nFigure 4.2.21 Add More Annotations -Dashboard4.2.22 Add Customized Year Legends\r\n•1. Create a excel file as shown in the screen shoot\r\n•2. Import the sheet in the tableau desktop and drag year to ‘Marks>>Color’\r\n•3. Edit color accordingly\r\nFigure 4.2.22 Add Customized Year Legends4.2.24 Add Customized Year Legends to Dashboard\r\nFor the final step,\r\n•1. Drag the ‘Year Label’ sheet to main dashboard; Change the status to ‘Floating’ by clicking the reversed triangle icon\r\n•2. Remove default ‘Worksheet’ settings\r\n•3. Add ‘Annotations>>Marks’ as we did in previous steps\r\nFigure 4.2.24 Add Customized Year Legends to DashboardBravo! We have completed the dashboard!\r\n5. Major Observations\r\nFigure 5 DataViz Makeover•1. From the scatter plot, we understand that Singapore’s largest leading merchandise partners are Mainland China, Malaysia and United States with total trading value over 100 Billion SGD dollars, especially Mainland China at 137 Billion.\r\n•2. With the reference line in the middle of scatter plot as well as different colors, we can tell that Singapore has trade plus with Mainland China, United States, Hong Kong and Japan in year 2020, while trade deficit with Malaysia and Taiwan. In particular, the total export values changed significantly for US and Malaysia that United States switched from trade deficit to trade surplus in year 2020 and merchandise export to Malaysia decreased significantly (at 18%).\r\n•3. In the Quarterly Trend chart, for export values, significant drops are observed for China and Malaysia in 19Q4 to 20Q1 while there is upward trend for US, Hong Kong and Taiwan in general. For import values, during 19Q4 to 20Q1, Singapore’s merchandise import shrank with all major partners except Japan.\r\nThank you for reading up to this point!\r\nThat’s all for my first blog.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-12T23:13:55+08:00",
    "input_file": "welcome.knit.md"
  }
]
